Merge pull request #103 from npatsakula/amd_backend_tk
backend: AMD TK support.
